<a href="https://colab.research.google.com/github/RCML2016/MasteringWithPythonV1.0/blob/main/MasteringwithPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#Lets create a Data Frame with Diemensions 10 X 4
values_1 = np.random.randint(10, size=10)
values_2 = np.random.randint(10, size=10)
years = np.arange(2010,2020)
groups = ['A','A','B','A','B','B','C','A','C','C']
df1 = pd.DataFrame({'group':groups, 'year':years, 'value_1':values_1, 'value_2':values_2})
df1

  group  year  value_1  value_2
0     A  2010        1        3
1     A  2011        3        6
2     B  2012        6        1
3     A  2013        9        0
4     B  2014        4        2
5     B  2015        7        4
6     C  2016        0        6
7     A  2017        0        4
8     C  2018        2        7
9     C  2019        0        7

In [ ]:
##1 QUERY##
#It is very simple to use query function which only requires to write the condition for filtering.
df1.query('value_1 < value_2')

  group  year  value_1  value_2
0     A  2010        1        3
1     A  2011        3        6
6     C  2016        0        6
7     A  2017        0        4
8     C  2018        2        7
9     C  2019        0        7

In [ ]:
##2-INSERT into DatafRame
##When we want to add a new column to a dataframe, it is added at the end by default. However, pandas offers the option to add the new column in any position using insert function.
##We need to specify the position by passing an index as first argument. This value must be an integer. Column indices start from zero just like row indices. The second argument is column name and the third argument is the object that includes values which can be Series or an array-like object.##

newCol4insert=np.random.randn(10)

#insert the new column at position 2
df1.insert(2, 'newCol4insert', newCol4insert)
df1

  group  year  newCol4insert  value_1  value_2
0     A  2010       1.071192        1        3
1     A  2011      -0.224278        3        6
2     B  2012       1.047361        6        1
3     A  2013       0.314552        9        0
4     B  2014      -0.059304        4        2
5     B  2015       1.589781        7        4
6     C  2016       0.455811        0        6
7     A  2017       2.210062        0        4
8     C  2018      -0.264692        2        7
9     C  2019       0.845024        0        7

In [ ]:
##3 -CUMILATIVE SUM
df1['CumSum1']=df1[['value_2','group']].groupby('group').cumsum()
df1

  group  year  newCol4insert  value_1  value_2  CumSum1
0     A  2010       1.071192        1        3        3
1     A  2011      -0.224278        3        6        9
2     B  2012       1.047361        6        1        1
3     A  2013       0.314552        9        0        9
4     B  2014      -0.059304        4        2        3
5     B  2015       1.589781        7        4        7
6     C  2016       0.455811        0        6        6
7     A  2017       2.210062        0        4       13
8     C  2018      -0.264692        2        7       13
9     C  2019       0.845024        0        7       20

In [ ]:
##4. SAMPLE
##Sample method allows you to select values randomly from a Series or DataFrame. It is useful when we want to select a random sample from a distribution.

sample=df1.sample(5)
sample
sample2=df1.sample(frac=0.5)
sample2

  group  year  newCol4insert  value_1  value_2  CumSum1
9     C  2019       0.845024        0        7       20
6     C  2016       0.455811        0        6        6
3     A  2013       0.314552        9        0        9
5     B  2015       1.589781        7        4        7
1     A  2011      -0.224278        3        6        9

In [ ]:
##5-WHERE CONDITION#
# #“Where” is used to replace values in rows or columns based on a condition. The default replacement values is NaN but we can also specify the value to be put as a replacement.
#df1['newCol4insert'].where(df['newcol4insert']>0,0)

df1['newCol4insert'].where(df1['newCol4insert'] > 0 , 0)

0    1.071192
1    0.000000
2    1.047361
3    0.314552
4    0.000000
5    1.589781
6    0.455811
7    2.210062
8    0.000000
9    0.845024
Name: newCol4insert, dtype: float64

In [ ]:
## 6 -ISIN method

years=['2011','2015','2018']
df1[df1.year.isin(years)]

  group  year  newCol4insert  value_1  value_2  CumSum1
1     A  2011      -0.224278        3        6        9
5     B  2015       1.589781        7        4        7
8     C  2018      -0.264692        2        7       13

In [ ]:
##7 -LOC & iLoc

df1.iloc[:5,:3]

  group  year  newCol4insert
0     A  2010       1.071192
1     A  2011      -0.224278
2     B  2012       1.047361
3     A  2013       0.314552
4     B  2014      -0.059304

In [ ]:
df1.loc[:5,['year','group']]

   year group
0  2010     A
1  2011     A
2  2012     B
3  2013     A
4  2014     B
5  2015     B

In [ ]:
df1.loc[[1,5,7],['year','group']]

   year group
1  2011     A
5  2015     B
7  2017     A

In [ ]:
##8 PCT_Chane
df1.value_2.pct_change()
df1.value_1.pct_change()

0         NaN
1    2.000000
2    1.000000
3    0.500000
4   -0.555556
5    0.750000
6   -1.000000
7         NaN
8         inf
9   -1.000000
Name: value_1, dtype: float64

In [ ]:
##9 RANK function

df1['rank_1']=df1['value_1'].rank()
df1

  group  year  newCol4insert  value_1  value_2  CumSum1  rank_1
0     A  2010       1.071192        1        3        3     4.0
1     A  2011      -0.224278        3        6        9     6.0
2     B  2012       1.047361        6        1        1     8.0
3     A  2013       0.314552        9        0        9    10.0
4     B  2014      -0.059304        4        2        3     7.0
5     B  2015       1.589781        7        4        7     9.0
6     C  2016       0.455811        0        6        6     2.0
7     A  2017       2.210062        0        4       13     2.0
8     C  2018      -0.264692        2        7       13     5.0
9     C  2019       0.845024        0        7       20     2.0

In [ ]:
##9-Melt
city=['A','B','C','D','E']
values_1 = np.random.randint(5, size=5)
day1=['10','15','16','13','12']
day2=['11','15','16','13','9']
day3=['4','8','7','9','10']
day4=['1','5','6','3','2']

#values_1 = np.random.randint(5, size=2)
df_wide=pd.DataFrame({'city':city,'values_1':values_1,'day1':day1,'day2':day2,'day3':day3,'day4':day4})
df_wide

  city  values_1 day1 day2 day3 day4
0    A         4   10   11    4    1
1    B         1   15   15    8    5
2    C         0   16   16    7    6
3    D         2   13   13    9    3
4    E         1   12    9   10    2

In [ ]:
df_wide.melt(id_vars=['city'])

   city  variable value
0     A  values_1     4
1     B  values_1     1
2     C  values_1     0
3     D  values_1     2
4     E  values_1     1
5     A      day1    10
6     B      day1    15
7     C      day1    16
8     D      day1    13
9     E      day1    12
10    A      day2    11
11    B      day2    15
12    C      day2    16
13    D      day2    13
14    E      day2     9
15    A      day3     4
16    B      day3     8
17    C      day3     7
18    D      day3     9
19    E      day3    10
20    A      day4     1
21    B      day4     5
22    C      day4     6
23    D      day4     3
24    E      day4     2

In [ ]:
##10-  Explode :
##Assume your data set includes multiple entries of a feature on a single observation (row) but you want to analyze them on separate rows.

ID=['A','B','C','D','E']
DAY=[1,2,3,4,5]
VALUE=[1,2,3,4,[1,2,3,4,5]]

df_explode=pd.DataFrame({'ID':ID,'DAY':DAY,'VALUE':VALUE})

df_explode

  ID  DAY            VALUE
0  A    1                1
1  B    2                2
2  C    3                3
3  D    4                4
4  E    5  [1, 2, 3, 4, 5]

In [ ]:

#df_explode('VALUE').reset_index(drop=True)
#df1.explode('VALUE').reset_index(drop=True)

In [ ]:
#10-Nunique

#Nunique counts the number of unique entries over columns or rows. It is very useful in categorical features especially in cases where we do not know the number of categories beforehand

#df1.year.nunique()' At a single column level
#df1.group.nunique() '

df1.nunique(axis=1) # at the Data Frame level

0    6
1    6
2    6
3    6
4    7
5    6
6    6
7    7
8    7
9    7
dtype: int64

In [ ]:
#LookUp:

#df1['Person_point'] = df1.lookup(df1.index, df1['year'])
#df1

In [ ]:
#Infor_Objects#

df1.dtypes

group             object
year               int64
newCol4insert    float64
value_1            int64
value_2            int64
CumSum1            int64
rank_1           float64
dtype: object

In [ ]:
df1.infer_objects().dtypes

group             object
year               int64
newCol4insert    float64
value_1            int64
value_2            int64
CumSum1            int64
rank_1           float64
dtype: object

In [ ]:
df_large = pd.DataFrame({'A': np.random.randn(1000000),
                    'B': np.random.randint(100, size=1000000)})
#df_large
#df_large.shape
(1000000, 2)

df_large.memory_usage()

Index        128
A        8000000
B        8000000
dtype: int64

In [ ]:
#Memory usage of entire dataframe in megabytes:
df_large.memory_usage().sum() / (1024**2) #converting to megabytes

15.2589111328125

In [ ]:
#Describe
df_large.describe()

                    A               B
count  1000000.000000  1000000.000000
mean         0.000125       49.483500
std          1.000740       28.878113
min         -4.707592        0.000000
25%         -0.674152       24.000000
50%         -0.000124       49.000000
75%          0.675173       75.000000
max          5.120537       99.000000